using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Globalization;

namespace PerfektImporter
{
    public enum DocKind
    {
        Invoice = 1,
        Debit = 2,
        Credit = 3
    }

    /// <summary>
    ///за покупки/продажби възможни стойности са:
    ///1 - фактура
    ///2 - дебитно известие
    ///3 - кредитно известие  -с минсува стойност 
    /// </summary>
    public enum BuySell
    {
        Sell = 1,
        Buy = 2
    }

    public enum XmlTags
    {
        ACCDATE,
        DOCDATE,
        OPERATION,
        PERFORMER,
        BGBULSTAT,
        BULSTAT,
        SUBJECT,
        SUM,
        BRUTO,
        FEE
    }

    public class Common
    {
        public const string TEXT_invoice = "фактура";
        public const string TEXT_debit = "дебитно известие";
        public const string TEXT_credit = "кредитно известие";
        public const string TEXT_buy = "Покупка";
        public const string TEXT_sell = "Продажба";

        public const int DT_ACC_BUY = 304;
        public const int DT_ACC_SELL = 501;
        public const int CR_ACC_BUY = 501;
        public const int CR_ACC_SELL = 702;

        public static decimal ParseDecimal(string s)
        {
            s = s.Replace(",", CultureInfo.InvariantCulture.NumberFormat.NumberDecimalSeparator);
            return decimal.Parse(s, NumberStyles.Any, CultureInfo.InvariantCulture);
        }

        public const string DESCRIPTION = @"Файла е в XML Формат.
 
Първия ред е равен на = <?xml version='1.0' encoding='ISO-8859-1' ?>

Останалите тагове са:

<TDOC_LIST> - Указва списък с подавани данни. Данни в тага са обекти от тип <TDOCUMENT>. Данните в тага TDOCUMENT описват един счетоводен документ в Перфект. Ето полетата на TDOCUMENT:
<DOCKIND> -Integer – тип на документа, по който се осчетоводява. Стойностите са:
 
1. Вид фактура - полето трябва да се попълва само със следните стойности 
за покупки - възможни стойности са: 
1 - фактура
2 - дебитно известие
3 - кредитно известие
7 - митническа декларация
9 - протокол или др.док-т
 
за продажби възможни стойности са:
1 - фактура
2 - дебитно известие
3 - кредитно известие
7 - митническа декларация
9 - протокол или др.док-т
81 - Отчет за извършени продажби
82 - От-т за изв.продажби при спец.ред на обл.
 

за друга операция е без значение полето - но може да се попълва с 9 - протокол;
<OPERCODE> - Integer Код на операция – Стойностите са взети според колоните дневниците за покупки и продажби + друга операция. Стойностите са:
•	ПОКУПКИ
    o	101 - Покупка - (9) доставка,внос и ВОП без ДДС и ДК
    o	102 - Покупка - (10-11) доставка,внос и ВОП с ДДС и ДК
    o	103 - Покупка - (12-13) доставка,внос и ВОП с частичен ДДС и ДК
    o	104 - Покупка - (15) при придобиване на стоки от посредник в тристранна операция
    o	105 - Покупка - (11) Само ДДС - доставка,внос и ВОП с ДДС и ДК
    o	106 - Покупка - (13) Само ДДС - доставка,внос и ВОП с частичен ДДС и ДК
    o	107 - Покупка - (14) Годишна корекция по чл. 73, ал. 8 ЗДДС
•	ПРОДАЖБИ
    o	201 - Продажба - (11-12) доставка и дист. продажби със ставка 20%
    o	202 - Продажба - (13-15) ВОП
    o	203 - Продажба - (14-15) доставки по чл. 82
    o	204 - Продажба - (16) данък 20% в други случаи
    o	205 - Продажба - (17-18) доставки със ставка 9%
    o	206 - Продажба - (19) доставка със ставка 0% от глава 3-та
    o	207 - Продажба - (20) Вътреобщностни Доставки на стоки (ВОД)
    o	208 - Продажба - (21) доставка по чл. 140,146,173
    o	209 - Продажба - (22) доставка на услуги по чл. 21, ал 2
    o	210 - Продажба - (23) доставка по чл. 69 и дист. продажби в страна членка
    o	211 - Продажба - (24) освободени доставки
    o	212 - Продажба - (25) доставка като посредник в тристранни операции
    o	213 - Продажба - (12) Само ДДС - доставка и дист. продажби със ставка 20%
    o	214 - Продажба - (15) Само ДДС - доставки по чл. 82
    o	215 - Продажба - (18) Само ДДС - доставки със ставка 9%
    o	216 - Продажба - (24) освободени ВОП
•	301 - Друга операция


<ACCDATE> String - Дата на осчетоводяване – формат DD.MM.YYYY
<DOCDATE> String  - Дата на документа – формат DD.MM.YYYY 
<DOCNO>  String– номер на документ – например номер на фактурата, която се осчетоводява.
<FOLDER> String – Папка – В коя папка ще бъде осчетоводен документа 
<INFO> String –  Текст описващ осчетоводяваните данни
<OPERATION> String –  Допълнителен текст описващ осчетоводяваните данни
<SUBJECT> String –  Предмет на сделката – за дневника
<PERFORMER> String –  Име на фирма контрагент
<BULSTAT> String –  Булстат на фирмата
<BGBULSTAT> String –  ИН по ЗДДС за дневника

<TDOC_ITEM> Списък с данни за осчетоводяване. Ако в един <TDOCUMENT> има повече от един <TDOC_ITEM> - това е сложно контиране. Всеки един елемент между таговете <TDOC_ITEM> описват една „контировка”. Таговете на „контировката” са: 

<DT_ACC> String - Сметка Дебит 
<CR_ACC> String - Сметка Кредит
		За сметките – очаква се поредица от числа разделени с разделител ‘-’. Първото число указва сметката, второто – номер на партида от 1 аналитично ниво, трето число – номер на партида на 2 аналитично ниво и т.н до 5 нива. Заложено е подаването да данни за 5 аналитични нива. Ако сметката няма партида на съответното аналитично ниво, то на съответното място не се подава число, а празен стринг.
Например за сметка 602 трябва да се подаде 602-----. За сметка 601 с партида номер 3 на ан.ниво 1 се подава 601-3----.
<SUM> String -Обща сума за осчетоводяване – XXXXX.XX – броя на X не е твърд, изисква се подаване на числа с един разделител ‘.’ за десетична точка
<BRUTO> - String – Стойност за осчетоводяване – XXXXX.XX – броя на X не е твърд, изисква се подаване на числа с един разделител ‘.’ за десетична точка
<FEE>- String – ДДС стойност за осчетоводяване – XXXXX.XX – броя на X не е твърд, изисква се подаване на числа с един разделител ‘.’ за десетична точка
<DDS>- String – ДДС процент –XX.XX – броя на X не е твърд, изисква се подаване на числа с един разделител ‘.’ за десетична точка – например 20 % се подава като 20.00
Стойностите в числовите тагове по горе трябва да отговарят на формулите:
<BRUTO>*(<DDS>/100)=<FEE>
<BRUTO>+<FEE>=<SUM>



Файловете трябва да бъдат записвани със разширение  .acc, за да се разграничават от останалите файлове на диска.
";
    }

}
